In [1]:
! pip install pandas
! pip install numpy

Requirement already satisfied: pandas in c:\users\malik\desktop\let-us-python-tut\.venv\lib\site-packages (2.3.1)
Requirement already satisfied: numpy>=1.23.2 in c:\users\malik\desktop\let-us-python-tut\.venv\lib\site-packages (from pandas) (2.3.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\malik\desktop\let-us-python-tut\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\malik\desktop\let-us-python-tut\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\malik\desktop\let-us-python-tut\.venv\lib\site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in c:\users\malik\desktop\let-us-python-tut\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Requirement already satisfied: numpy in c:\users\malik\desktop\let-us-python-tut\.venv\lib\site-packages (2.3.1)

In [2]:
import numpy as np
import pandas as pd

In [3]:
ser1=pd.Series()
print(ser1,end="\n\n")
data=np.array(['a','e','i','o','u'])
ser2=pd.Series(data)
print(ser2)

Series([], dtype: object)

0    a
1    e
2    i
3    o
4    u
dtype: object

In [4]:
lst=['sam','Prash','Raj','Kulki','Adi']
ser1=pd.Series(lst)
print(ser1,end="\n\n")
tpl=('sam','Prash','Raj','Kulki','Adi')
ser2=pd.Series(tpl)
print(ser2,end="\n\n")
dt={'sam':23,'Prash':25,'Raj':90,'Kulki':66,'Adi':34}
ser3=pd.Series(dt)
print(ser3)

0      sam
1    Prash
2      Raj
3    Kulki
4      Adi
dtype: object

0      sam
1    Prash
2      Raj
3    Kulki
4      Adi
dtype: object

sam      23
Prash    25
Raj      90
Kulki    66
Adi      34
dtype: int64

In [5]:
# Same data type
data1=[10,20,30,40]
data2=[10,'Sakib','Malik',8954664647]
ser1=pd.Series(data1)
ser2=pd.Series(data2)
print(ser1,end="\n\n")
print(ser2,end="\n\n")

0    10
1    20
2    30
3    40
dtype: int64

0            10
1         Sakib
2         Malik
3    8954664647
dtype: object

In [6]:
# Properties
data=np.array(['a','e','i','o','u'])
ser=pd.Series(data)
print(ser.shape)
print(ser.size)
print(ser.ndim)
print(data.ndim)
print(data.dtype)
print(ser.dtype)
# print(data.index)
print(ser.index)
print(ser.values)
print(ser.value_counts())
print(ser.empty)

(5,)
5
1
1
<U1
object
RangeIndex(start=0, stop=5, step=1)
['a' 'e' 'i' 'o' 'u']
a    1
e    1
i    1
o    1
u    1
Name: count, dtype: int64
False

In [7]:
# Accessing series data
data=[100,200,300,400]
ndx=['Apple','Kiwi','Orange','Graphes']
ser=pd.Series(data,ndx)
print(ser,end="\n\n")
print(ser.Apple,end="\n\n")
print(ser.at['Apple'],end="\n\n")
print(ser.iat[0],end="\n\n")
print(ser.loc['Apple':'Orange'],end="\n\n")
print(ser.iloc[1:],end="\n\n")

Apple      100
Kiwi       200
Orange     300
Graphes    400
dtype: int64

100

100

100

Apple     100
Kiwi      200
Orange    300
dtype: int64

Kiwi       200
Orange     300
Graphes    400
dtype: int64

In [17]:
# Series Methods
keys=['a','b','c','d','e','f','g','h','i','j','k']
data=[100,200,300,400,500,400,800,100,300,200,100]
ser=pd.Series(data,keys)
ser.head()
ser.tail()
ser.describe()
ser.count()
ser.unique()
ser.nunique()
len(ser.unique())
ser.value_counts()
ser.mean(), ser.median(),ser.mode()
ser.std(), ser.var()
ser.min(),ser.max()
ser.sum(),ser.cumsum()
ser.prod(),ser.cumprod()
ser.quantile()

np.float64(300.0)

In [22]:
#indexing
ser.loc['a']
ser.iloc[0]
ser.at['b']
ser.iat[1]

np.int64(200)

In [31]:
# Data Cleaning & Missin
ser.isnull()
ser.isnull().sum()
ser.notnull()
ser.notnull().sum()
ser.dropna()
ser.fillna(10)
ser.replace(100,800)

a    800
b    200
c    300
d    400
e    500
f    400
g    800
h    800
i    300
j    200
k    800
dtype: int64

In [38]:
# Element wise opeations
df = pd.DataFrame({
    'A': [1.235, -2.456, 3.678, -4.987],
    'B': [-10, 20, -30, 40]
})
df['A_Rounded']=df['A'].apply(round)

In [41]:
df['Abs']=df['A'].apply(abs)

In [44]:
df['B_abs']=df['A'].map(abs)
df

       A   B  A_Rounded    Abs  B_abs
0  1.235 -10          1  1.235  1.235
1 -2.456  20         -2  2.456  2.456
2  3.678 -30          4  3.678  3.678
3 -4.987  40         -5  4.987  4.987

In [46]:
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Score': [88, 95, 70, 88],
    'Age': [25, 23, 22, 24]
}, index=['d', 'b', 'a', 'c'])
df

      Name  Score  Age
d    Alice     88   25
b      Bob     95   23
a  Charlie     70   22
c    David     88   24

In [58]:
df.sort_values(by='Score')
df.sort_values(by=['Score','Age'])
df.sort_values(by=['Score','Age'],ascending=[False,True])
df.sort_index()
df['Score'].rank(method='min',ascending=False)

d    2.0
b    1.0
a    4.0
c    2.0
Name: Score, dtype: float64

In [59]:
df = pd.DataFrame({
    'Name': [' alice ', 'Bob', 'charlie', 'DAVID'],
    'Email': ['alice@gmail.com', 'bob@yahoo.com', 'charlie@gmail.com', 'david@hotmail.com']
})

df

      Name              Email
0   alice     alice@gmail.com
1      Bob      bob@yahoo.com
2  charlie  charlie@gmail.com
3    DAVID  david@hotmail.com

In [67]:
df['Name'].apply(lambda x: x.upper())
df['Name'].str.upper()
df['Email'].str.contains('gmail')
df['Email'].str.replace('gmail','google')
df['Email'].str.split('@').str[0]
df['Email'].str.strip()

0      alice@gmail.com
1        bob@yahoo.com
2    charlie@gmail.com
3    david@hotmail.com
Name: Email, dtype: object

In [69]:
df = pd.DataFrame({
    'A': [10, 20, 30, 40],
    'B': [1, 2, 3, 4],
    'C': [5, 4, 3, 2]
})
df

    A  B  C
0  10  1  5
1  20  2  4
2  30  3  3
3  40  4  2

In [79]:
df['A'].add(df['B'])
df['A'].sub(df['B'])
df['A'].mul(df["C"])
df['A'].div(df['B'])
df['A'].pow(df['B'])
df['A'].mod(df['C'])
df['A'].corr(df['C'])
df['B'].corr(df['C'])
df['A'].cov(df['C'])

np.float64(-16.666666666666664)

In [99]:
# Handlijg Duplicated
df = pd.DataFrame({
    'Name': ['Alice', 'Bob', 'Alice', 'David', 'Bob'],
    'Score': [85, 90, 85, 95, 90]
})

df
df.describe()
df.info()
df.duplicated()
df['Name'].duplicated()
df['Score'].duplicated()
df.drop_duplicates()
df.drop_duplicates(subset='Name')
df.drop_duplicates(subset='Score',keep='last')
df[df.duplicated()]
df[df.duplicated(subset='Name')]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Score   5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 208.0+ bytes

    Name  Score
2  Alice     85
4    Bob     90

In [102]:
# Aggregation Function
df = pd.DataFrame({
    'Math': [90, 80, 85, 70],
    'Science': [88, 76, 90, 75],
    'English': [92, 85, 88, 80]
})
df

   Math  Science  English
0    90       88       92
1    80       76       85
2    85       90       88
3    70       75       80

In [116]:
df.describe()
df.info()
df.sum()
df.min()
df['Math'].min()
df.max()
df['Math'].max()
df['Math'].sum()
df.median()
df["Math"].median()
df.std()
df['Math'].std()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Math     4 non-null      int64
 1   Science  4 non-null      int64
 2   English  4 non-null      int64
dtypes: int64(3)
memory usage: 224.0 bytes

np.float64(8.539125638299666)